NgQunz/STM32/STM32_BH1750_UART/USER/My_usart.c
#include "My_usart.h"
#include <stdio.h>
#include "stm32f10x.h"
#include "stm32f10x_gpio.h"
#include "stm32f10x_rcc.h"
#include "stm32f10x_usart.h"

/*******************************************************************************************/

// #if defined(__GNUC__)

// #define PUTCHAR_PROTOTYPE int _write_(int fd, char * ch, int len)

// #elif defined(__CC_ARM)

#define PUTCHAR_PROTOTYPE int fputc(int ch, FILE *f)

// #endif


uint16_t light_threshold = 100;
uint32_t ti_check_lux = 1000;
uint16_t light;

int fputc(int ch, FILE *f)
{

  //    USART_ClearFlag(USART1,USART_FLAG_TC);
  USART_SendData(USART1, (u8)ch);
  //    while (USART_GetFlagStatus(USART1,USART_FLAG_TC)==RESET){}
  while (USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET)
  {
  }
  return ch;
}

/*******************************************************************************************/

// #define string_size 80
volatile int8_t RX_available = 0;
volatile uint8_t RX_Buffer[string_size];
volatile uint8_t RX_index = 0;
volatile uint16_t receive_length = 0;

void usart1_cfg_A9A10(uint32_t baud_rate) /// datasheet, trang 31, bang remap
{
  /// cap clock cho uart1
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE); /// Cáº¥p clock cho USART1R
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);  /// Cáº¥p clock cho GPIOA

  /// cáº¥u hÃ¬nh gpio cho A9,A10
  //  GPIO_PinRemapConfig(GPIO_Remap_USART1,ENABLE);
  /// remap cÃ¡c pin cho USART1.
  /// datasheet, trang 31, bang remap

  GPIO_InitTypeDef GPIO_struct;
  GPIO_struct.GPIO_Pin = GPIO_Pin_9; /// TX
  GPIO_struct.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_struct.GPIO_Mode = GPIO_Mode_AF_PP;
  GPIO_Init(GPIOA, &GPIO_struct);

  GPIO_struct.GPIO_Pin = GPIO_Pin_10; /// RX
  GPIO_struct.GPIO_Mode = GPIO_Mode_IPU;
  GPIO_Init(GPIOA, &GPIO_struct);

  /// cau hinh cho UART1

  USART_InitTypeDef USART_struct;
  USART_struct.USART_BaudRate = baud_rate;
  USART_struct.USART_Mode = USART_Mode_Tx | USART_Mode_Rx;
  USART_struct.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
  USART_struct.USART_Parity = USART_Parity_No;
  USART_struct.USART_StopBits = USART_StopBits_1;
  USART_struct.USART_WordLength = USART_WordLength_8b;
  USART_Init(USART1, &USART_struct);

  USART_ClearFlag(USART1, USART_FLAG_TC);

  USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
  NVIC_EnableIRQ(USART1_IRQn);
  NVIC_SetPriority(USART1_IRQn, 1);

  USART_Cmd(USART1, ENABLE);
	while (USART_GetFlagStatus(USART1, USART_FLAG_RXNE))
{
    volatile uint8_t dummy = USART_ReceiveData(USART1);
}

  RX_available = 0;
  RX_index = 0;
  receive_length = 0;
}

void USART1_IRQHandler(void)
{
  if (USART_GetITStatus(USART1, USART_IT_RXNE) != RESET)
  {
    char temp_char = USART_ReceiveData(USART1);
		
    if (temp_char != '\n')
    {
      RX_Buffer[RX_index] = temp_char;
      RX_index++;
    }
    else if (temp_char == '\n' || temp_char == '\r')
{
    receive_length = RX_index;
    RX_Buffer[RX_index] = 0x00; // NULL
    RX_available = 1;
    RX_index = 0;
}

  }
  USART_ClearITPendingBit(USART1, USART_IT_RXNE);
}
void uart_handle_command(void)
{
    if (!RX_available) return;
    RX_available = 0;

    printf_string("Nhan: ");
    printf_string((uint8_t *)RX_Buffer);
    printf_string("\r\n");

    if (strncmp((char*)RX_Buffer, "SET_LIGHT_THRESHOLD:", 20) == 0)
    {
        int value = atoi((char*)&RX_Buffer[20]);
        light_threshold = value;

        printf_string("Da thiet lap threshold = ");
        printf_num(light_threshold);
        printf_string(" lux\r\n");
    }
    else if (strncmp((char*)RX_Buffer, "LIGHT_INTENSITY:", 16) == 0)
    {
        printf_string("LIGHT_INTENSITY: ");
        printf_num(light);
        printf_string(" lx\r\n");
    }
    else
    {
        printf_string("Lenh khong hop le!\r\n");
    }

    // ðŸ” Reset buffer sau khi xá»­ lÃ½
    for (int i = 0; i < string_size; i++) RX_Buffer[i] = 0;
    receive_length = 0;
    RX_index = 0;
    RX_available = 0;
}



static void send_char(uint8_t c)
{ /// HÃ m gá»­i má»™t kÃ­ tá»± ra COM
  //  USART_ClearFlag(USART2,USART_FLAG_TXE);
  USART_SendData(USART1, c);
  while (USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET)
    ; /// chá» Ä‘áº¿n khi cá» TXE Ä‘Æ°á»£c set -> Ä‘Ã£ chuyá»ƒn xong má»™t frame
}

void printf_string(uint8_t *str)
{ /// hÃ m Ä‘Æ°a má»™t xÃ¢u kÃ­ tá»± ra COM
  while ((*(str)) != NULL)
  {
    send_char(*(str++));
  }
  while (USART_GetFlagStatus(USART1, USART_FLAG_TC) == RESET)
  {
  }; /// Chá» Ä‘áº¿n khi cá» TC Ä‘Æ°á»£c set -> káº¿t thÃºc quÃ¡ trÃ¬nh truyá»n
}

static char convert_int_to_char(uint8_t n)
{ /// hÃ m chuyá»ƒn Ä‘á»•i sá»‘ ra kiá»ƒu char
  return n + 48;
}

void printf_num(int32_t num)
{ /// hÃ m Ä‘Æ°a má»™t sá»‘ ra COM
  if (!num)
  {
    send_char(convert_int_to_char(num));
    return;
  }
  if (num < 0)
  {
    num *= -1;
    send_char('-');
  }
  uint8_t rev_num[20];
  int i = 0;
  while (num != 0)
  {
    rev_num[i++] = num % 10;
    num /= 10;
  }
  i--;
  for (i; i >= 0; i--)
  {
    send_char(convert_int_to_char(rev_num[i]));
  }
  while (USART_GetFlagStatus(USART1, USART_FLAG_TC) == RESET)
  {
  };
}
/*******************************************************************************************/

/*end of file*/
